/**
 * Created by hy1 on 2017/9/14.
 */
$('#queryMore').click(function () {
    $(this).children('.query-sign').html('&lt;&lt;');
    $('.num-info').toggleClass('show')
})
var buyers=$('.buyer').map(function(){
    var str=this.innerHTML;
    console.dir(str);
    if(str=='买家'){
        this.style.color='#e31';

    }else if(str=='卖家'){
        this.style.color='#0e2'
    }

})
var orderInfo=[
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"}
]
//客户管理 修改用户
var resetUser=''
new Vue({
    el:'#userReset',
    data:{
        title:['客户名','客户状态','真实姓名','电话','所属运营中心','账户余额','是否冻结资金','注册时间',"身份证号码",'银行卡开户行','持卡人','账号','']
    }
})
$('#settlementdateS').focusin(

)
//优惠券管理
/*var SaleTemplate='<div class="sale-tab">\
    <table class="sale-tab-head" v-for="title in tabTitle">\
    <tr>\
    <td>{{title.label}}</td>\
    </tr>\
    </table>\'
var saleMagager=new Vue({
    el:'#saleOperata',
    template:SaleTemplate,
    data:{
        tabTitle:[
            {'label':'编号',width:"100px"},
            {'label':'优惠券金额',width:"220px"},
            {'label':'有效期',width:"350px"},
            {'label':'查看领取用户',width:"200px"},
            {'label':'操作',width:"100px"},
        ]
    }
});*/
$('.sale-tab-body tr td:last-child').click(function(){
    console.log(1);
    $(this).parent().remove('tr');
})
$('.choose-all').click(function() {
    $('.sale-tab-body tr input[type=checkbox]').each(function () {

        if ($(this).prop("checked") == true) {
            $(this).prop('checked', true);
            return;
        } else {
            $(this).prop('checked', false);
            return;
        }
    })
})
$('.choose-no').click(function(){

})
$('.sale-tab-body tr td:first-child').each(function(){

})


