/**
 * Created by hy1 on 2017/9/14.
 */
$('#queryMore').click(function () {
    $(this).children('.query-sign').html('&lt;&lt;');
    $('.num-info').toggleClass('show')
})
var buyers=$('.buyer').map(function(){
    var str=this.innerHTML;
    console.dir(str);
    if(str=='买家'){
        this.style.color='#e31';

    }else if(str=='卖家'){
        this.style.color='#0e2'
    }

})
var orderInfo=[
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"},
    {"序号":1,"建仓日期":'2017-09-12',"登录账号":"1555333444","微信昵称":"xiaoming","用户名称":"张三","所属业务代理":"null","所属运营中心":"众盈信汇运营(001)","商品名称":"比特币","入仓价":194550.01,"买卖类型":"卖家","订单编号":"20170914143223"}
]
//客户管理 修改用户
var resetUser=''
new Vue({
    el:'#userReset',
    data:{
        title:['客户名','客户状态','真实姓名','电话','所属运营中心','账户余额','是否冻结资金','注册时间',"身份证号码",'银行卡开户行','持卡人','账号','']
    }
})
//优惠券管理
$('.sale-tab-body tr td:last-child').click(function(){
    $(this).parent().remove('tr');
})
$('.choose-all').click(function() {
    $('.sale-tab-body tr input[type=checkbox]').each(function () {

        if ($(this).prop("checked") == true) {
            $(this).prop('checked', true);
        } else {
            $(this).prop('checked', true);
        }
    })
})
$('.choose-no').click(function(){
    $('.sale-tab-body tr input[type=checkbox]').each(function () {
        if ($(this).prop("checked") == true) {
            $(this).prop('checked', false);
        }
    })
})
$('.reverse').click(function(){
    $('.sale-tab-body tr input[type=checkbox]').each(function () {
        var status=$(this).prop('checked');
            $(this).prop('checked',!status);
    })
})
$('.sale-tab-body tr td:first-child').each(function(){

})


